NEST/src/Geral/Nfse/Templates/consultar-situacao.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:svc="http://nfse.abrasf.org.br">
  <soap:Body>
    <svc:ConsultarSituacaoLoteRps>
      <Prestador>
        <CpfCnpj>
          <Cnpj>{{cnpj}}</Cnpj>
        </CpfCnpj>
        <InscricaoMunicipal>{{inscricaoMunicipal}}</InscricaoMunicipal>
      </Prestador>
      <Protocolo>{{protocolo}}</Protocolo>
    </svc:ConsultarSituacaoLoteRps>
  </soap:Body>
</soap:Envelope>