ReInf/Nfse/Nova pasta/tx2/grupo/retorno/2018-05-30-14-01-44-500_1527692061330_consultar_lote_rps_envio.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br"><soapenv:Header/>   <soapenv:Body><nfse:ConsultarLoteRpsRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.02"><versaoDados>2.02</versaoDados></cabecalho>]]></nfseCabecMsg><nfseDadosMsg><![CDATA[<ConsultarLoteRpsEnvio xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd"><Prestador><CpfCnpj><Cnpj>30143994000166</Cnpj></CpfCnpj><InscricaoMunicipal>42382</InscricaoMunicipal></Prestador><Protocolo>1527692061330</Protocolo></ConsultarLoteRpsEnvio>]]></nfseDadosMsg></nfse:ConsultarLoteRpsRequest></soapenv:Body></soapenv:Envelope>
